app/Http/Controllers/CarController.php

    public function index()
    {
        $car = Car::with('mechanic')->get();
---
select * from `cars`
select * from `mechanics` where `mechanics`.`id` in (1, 2, 3, 4, 5)