app/Http/Controllers/MechanicController.php

select * from `mechanics` where `mechanics`.`id` = 5 limit 1
---
    public function index()
    {
        $mechanic = Mechanic::find(5);